Flow_Over_Heated_Plate_SS/Fluid-openfoam_w_snappyhexmesh/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{

    Inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    Outlet
    {
        type            zeroGradient;
        value           uniform 300;
    }

    Coupling_Interface
    {
        type            fixedGradient;
        gradient        uniform 0;
    }

    Fluid_Walls
    {
        type            zeroGradient;
        value           uniform 300;
    }

    defaultFaces
    {
        type empty;
    }

}
