Flow_Over_Heated_Plate_SS/Fluid-openfoam_w_snappyhexmesh/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    Outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    Fluid_Walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    Coupling_Interface
    {
        type            fixedValue;
        value           uniform 0;
    }

}
