Flow_Over_Heated_Plate_SS/Fluid-openfoam_w_snappyhexmesh/0/nut

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    Outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    Fluid_Walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    Coupling_Interface
    {
        type            fixedValue;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}
