Flow_Over_Heated_Plate_SS/Fluid-openfoam_w_snappyhexmesh/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 103500;

boundaryField
{
	Inlet
	{
        type            zeroGradient;
        value           uniform 0;
	}
	Outlet
	{
        type            fixedValue;
        value           uniform 103500;
	}
    Fluid_Walls
    {
        type            zeroGradient;
        value           uniform 103500;
    }
    
    Coupling_Interface
    {
        type            zeroGradient;
        value           uniform 0;
    }
    defaultFaces
    {
    	type			empty;
    }
}
