Flow_Over_Heated_Plate_SS/Fluid-openfoam_w_snappyhexmesh/system/blockMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;
// make a the vertices for a box that has the corner at (-0.6 -0.1 -0.1) and (3.1 0.6 0.5)
vertices
(
    (-0.6 -0.1 -0.1)
    (3.1 -0.1 -0.1)
    (3.1 0.6 -0.1)
    (-0.6 0.6 -0.1)
    (-0.6 -0.1 0.5)
    (3.1 -0.1 0.5)
    (3.1 0.6 0.5)
    (-0.6 0.6 0.5)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (81 41 4) simpleGrading (.2 15 1)
);

defaultPatch
{
    type patch;
    faces
    (
        (0 1 5 4)
        (1 2 6 5)
        (2 3 7 6)
        (3 0 4 7)
        (0 3 2 1)
        (4 5 6 7)
    );
}

boundary
(
);

